<template>
  <div class="header">
    <v-container class="desk">
      <v-row class="pa-4 align-center justify-space-between">
        <div class="d-flex align-center mb-4">
          <nuxt-link to="/" class="logo d-flex align-center">
            <svg
              width="118"
              height="44"
              viewBox="0 0 118 44"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <path
                d="M52 31.6347H57.9104C59.7588 31.6347 61.2117 31.1857 62.269 30.2877C63.3339 29.382 63.8664 28.1263 63.8664 26.5205C63.8664 25.1887 63.4937 24.1157 62.7482 23.3014C62.0104 22.4795 60.953 21.9696 59.5762 21.7717C61.3258 20.9954 62.2005 19.5875 62.2005 17.5479C62.2005 16.003 61.6909 14.8272 60.6716 14.0205C59.6523 13.2062 58.2299 12.7991 56.4043 12.7991H52V31.6347ZM54.3162 21.0183V14.6256H55.9364C57.2448 14.6256 58.2451 14.8995 58.9373 15.4475C59.6295 15.9878 59.9756 16.7755 59.9756 17.8105C59.9756 18.8455 59.6257 19.6408 58.9259 20.1963C58.2337 20.7443 57.2372 21.0183 55.9364 21.0183H54.3162ZM54.3162 29.7854V23.0388H57.2144C58.5683 23.0388 59.6143 23.3394 60.3521 23.9406C61.0976 24.5342 61.4703 25.3714 61.4703 26.4521C61.4703 27.5251 61.1052 28.3508 60.3749 28.9292C59.6447 29.5 58.5912 29.7854 57.2144 29.7854H54.3162Z"
                fill="#2C2C2C"
              />
              <path
                d="M72.1122 32C73.0783 32 73.9607 31.7755 74.7594 31.3265C75.5581 30.8775 76.2122 30.2496 76.7219 29.4429V31.6347H78.9354V19.9452H76.7219V22.0799C76.2731 21.296 75.6379 20.6834 74.8164 20.242C74.0025 19.8006 73.1011 19.5799 72.1122 19.5799C70.9941 19.5799 69.9976 19.8501 69.1228 20.3904C68.2481 20.9307 67.5597 21.6689 67.0576 22.605C66.5556 23.5335 66.3046 24.5913 66.3046 25.7785C66.3046 26.981 66.5594 28.0502 67.069 28.9863C67.5863 29.9224 68.2823 30.6606 69.1571 31.2009C70.0394 31.7336 71.0245 32 72.1122 32ZM72.7056 30.0936C71.9145 30.0936 71.2108 29.911 70.5947 29.5457C69.9786 29.1728 69.4917 28.6629 69.1342 28.016C68.7843 27.3615 68.6094 26.6195 68.6094 25.79C68.6094 24.9528 68.7843 24.2108 69.1342 23.5639C69.4917 22.917 69.9786 22.411 70.5947 22.0457C71.2108 21.6728 71.9145 21.4863 72.7056 21.4863C73.5043 21.4863 74.2079 21.6728 74.8164 22.0457C75.4325 22.411 75.9156 22.917 76.2655 23.5639C76.6154 24.2108 76.7903 24.9528 76.7903 25.79C76.7903 26.6271 76.6154 27.3691 76.2655 28.016C75.9156 28.6629 75.4325 29.1728 74.8164 29.5457C74.2079 29.911 73.5043 30.0936 72.7056 30.0936Z"
                fill="#2C2C2C"
              />
              <path
                d="M84.7021 17.5822C85.0824 17.5822 85.4057 17.4452 85.6719 17.1712C85.9458 16.8973 86.0827 16.57 86.0827 16.1895C86.0827 15.809 85.9458 15.4855 85.6719 15.2192C85.4057 14.9452 85.0824 14.8082 84.7021 14.8082C84.3218 14.8082 83.9947 14.9452 83.7208 15.2192C83.4546 15.4855 83.3215 15.809 83.3215 16.1895C83.3215 16.57 83.4546 16.8973 83.7208 17.1712C83.9947 17.4452 84.3218 17.5822 84.7021 17.5822ZM83.5953 31.6347H85.8089V19.9452H83.5953V31.6347Z"
                fill="#2C2C2C"
              />
              <path
                d="M93.7333 32C94.5624 32 95.2964 31.8097 95.9354 31.4292L95.3763 29.6598C95.0416 29.911 94.6613 30.0365 94.2353 30.0365C93.3529 30.0365 92.9118 29.4353 92.9118 28.2329V21.6233H95.7186V19.9452H92.9118V15.5731H90.6982V19.9452H89.3975V21.6233H90.6982V28.3699C90.6982 29.519 90.9644 30.4132 91.4969 31.0525C92.0294 31.6842 92.7748 32 93.7333 32Z"
                fill="#2C2C2C"
              />
              <path
                d="M104.292 32C105.258 32 106.14 31.7755 106.939 31.3265C107.738 30.8775 108.392 30.2496 108.902 29.4429V31.6347H111.115V19.9452H108.902V22.0799C108.453 21.296 107.818 20.6834 106.996 20.242C106.182 19.8006 105.281 19.5799 104.292 19.5799C103.174 19.5799 102.177 19.8501 101.303 20.3904C100.428 20.9307 99.7394 21.6689 99.2373 22.605C98.7353 23.5335 98.4843 24.5913 98.4843 25.7785C98.4843 26.981 98.7391 28.0502 99.2488 28.9863C99.766 29.9224 100.462 30.6606 101.337 31.2009C102.219 31.7336 103.204 32 104.292 32ZM104.885 30.0936C104.094 30.0936 103.391 29.911 102.774 29.5457C102.158 29.1728 101.671 28.6629 101.314 28.016C100.964 27.3615 100.789 26.6195 100.789 25.79C100.789 24.9528 100.964 24.2108 101.314 23.5639C101.671 22.917 102.158 22.411 102.774 22.0457C103.391 21.6728 104.094 21.4863 104.885 21.4863C105.684 21.4863 106.388 21.6728 106.996 22.0457C107.612 22.411 108.095 22.917 108.445 23.5639C108.795 24.2108 108.97 24.9528 108.97 25.79C108.97 26.6271 108.795 27.3691 108.445 28.016C108.095 28.6629 107.612 29.1728 106.996 29.5457C106.388 29.911 105.684 30.0936 104.885 30.0936Z"
                fill="#2C2C2C"
              />
              <path
                d="M115.786 31.6347H118V12H115.786V31.6347Z"
                fill="#2C2C2C"
              />
              <path
                fill-rule="evenodd"
                clip-rule="evenodd"
                d="M3.23529 22C3.23529 20.4552 3.42197 18.954 3.774 17.5177L20.7058 24.6658V28.4706H4.38077C3.6398 26.4536 3.23529 24.274 3.23529 22ZM5.56279 31.0588H16.4605L16.098 32.5085L8.23637 34.7546C7.20293 33.6399 6.30323 32.3995 5.56279 31.0588ZM10.4725 36.8075C11.6822 37.7506 13.0105 38.5487 14.4312 39.1757L15.3733 35.4073L10.4725 36.8075ZM16.8787 40.0573L19.1283 31.0588H20.7058V40.7208C19.3881 40.631 18.1078 40.4052 16.8787 40.0573ZM38.4372 31.0588H27.5395L27.902 32.5085L35.7636 34.7546C36.7971 33.6399 37.6968 32.3995 38.4372 31.0588ZM33.5275 36.8075L28.6267 35.4073L29.5688 39.1757C30.9895 38.5487 32.3178 37.7506 33.5275 36.8075ZM23.2941 31.0588H24.8717L27.1213 40.0573C25.8922 40.4052 24.6118 40.631 23.2941 40.7208V31.0588ZM23.2941 28.4706H39.6192C40.3602 26.4536 40.7647 24.274 40.7647 22C40.7647 21.7634 40.7603 21.5278 40.7516 21.2932L27.3762 17.0861L23.2941 19.8311V28.4706ZM30.1251 15.2378L36.9454 10.6516C38.666 12.9141 39.8847 15.5791 40.4352 18.4807L30.1251 15.2378ZM15.4437 19.6349L4.56718 15.0431C5.96682 11.539 8.39239 8.5556 11.4726 6.46429L15.4437 19.6349ZM18.5413 20.9426L20.7058 21.8564V3.27922C18.2328 3.44768 15.8914 4.09527 13.7736 5.1299L18.5413 20.9426ZM23.2941 16.7122L35.226 8.68879C32.1196 5.6022 27.9389 3.59559 23.2941 3.27922V16.7122ZM22 44C34.1503 44 44 34.1503 44 22C44 9.84974 34.1503 0 22 0C9.84974 0 0 9.84974 0 22C0 34.1503 9.84974 44 22 44Z"
                fill="#52B059"
              />
              <path
                d="M26.9015 14.9648C24.8007 12.1859 24.8298 8.42069 28.0319 5.99996C30.1327 8.77886 30.1036 12.5441 26.9015 14.9648Z"
                fill="#52B059"
              />
              <path
                d="M11.6332 19.6741C8.59993 17.9609 7.12805 14.4952 9.10214 11C12.1354 12.7132 13.6073 16.1789 11.6332 19.6741Z"
                fill="#52B059"
              />
              <path
                d="M15.7744 15.5541C14.2863 12.4044 15.0846 8.72469 18.7141 7.00988C20.2023 10.1596 19.4039 13.8393 15.7744 15.5541Z"
                fill="#52B059"
              />
              <path
                d="M7.99999 25.0589C11.346 26.0282 14.8523 24.6559 15.9693 20.8003C12.6233 19.8309 9.11698 21.2033 7.99999 25.0589Z"
                fill="#52B059"
              />
              <path
                d="M35.6532 24.5751C32.2175 23.9988 29.6522 21.2427 30.3162 17.2838C33.7518 17.8601 36.3172 20.6162 35.6532 24.5751Z"
                fill="#52B059"
              />
              <path
                d="M93.7333 32C94.5624 32 95.2964 31.8097 95.9354 31.4292L95.3763 29.6598C95.0416 29.911 94.6613 30.0365 94.2353 30.0365C93.3529 30.0365 92.9117 29.4353 92.9117 28.2329V21.6233H95.7186V19.9452H92.9117V15.5731H90.6982V19.9452H89.3975V21.6233H90.6982V28.3699C90.6982 29.519 90.9644 30.4132 91.4969 31.0525C92.0294 31.6842 92.7748 32 93.7333 32Z"
                fill="#52B059"
              />
              <path
                d="M104.292 32C105.258 32 106.14 31.7755 106.939 31.3265C107.738 30.8775 108.392 30.2496 108.902 29.4429V31.6347H111.115V19.9452H108.902V22.0799C108.453 21.296 107.818 20.6834 106.996 20.242C106.182 19.8006 105.281 19.5799 104.292 19.5799C103.174 19.5799 102.177 19.8501 101.303 20.3904C100.428 20.9307 99.7394 21.6689 99.2373 22.605C98.7353 23.5335 98.4843 24.5913 98.4843 25.7785C98.4843 26.981 98.7391 28.0502 99.2487 28.9863C99.766 29.9224 100.462 30.6606 101.337 31.2009C102.219 31.7336 103.204 32 104.292 32ZM104.885 30.0936C104.094 30.0936 103.391 29.911 102.774 29.5457C102.158 29.1728 101.671 28.6629 101.314 28.016C100.964 27.3615 100.789 26.6195 100.789 25.79C100.789 24.9528 100.964 24.2108 101.314 23.5639C101.671 22.917 102.158 22.411 102.774 22.0457C103.391 21.6728 104.094 21.4863 104.885 21.4863C105.684 21.4863 106.388 21.6728 106.996 22.0457C107.612 22.411 108.095 22.917 108.445 23.5639C108.795 24.2108 108.97 24.9528 108.97 25.79C108.97 26.6271 108.795 27.3691 108.445 28.016C108.095 28.6629 107.612 29.1728 106.996 29.5457C106.388 29.911 105.684 30.0936 104.885 30.0936Z"
                fill="#52B059"
              />
              <path
                d="M115.786 31.6347H118V12H115.786V31.6347Z"
                fill="#52B059"
              />
            </svg>
          </nuxt-link>
          <div
            @mouseover="
              $store.state.all_cities.length > 0
                ? (hover_city = true)
                : (hover_city = false)
            "
            @mouseleave="hover_city = false"
            class="d-flex align-center ml-6 relative"
          >
            <img src="@/assets/image/icons/location-green.svg" alt="" />
            <p class="grey-color pointer">г. {{ $store.state.my_city.name }}</p>

            <div v-if="hover_city" class="drop-down">
              <div class="drop-down-wrapper">
                <p
                  @click="changeCity(item)"
                  v-for="(item, index) in $store.state.all_cities"
                  :key="index"
                  class="pointer gilroy"
                >
                  {{ item.name }}
                </p>
              </div>
            </div>
          </div>
        </div>

        <div class="search">
          <v-form @submit.prevent="searchIt">
            <input
              v-model="searching"
              type="text"
              class="search-bar"
              placeholder="Поиск по Baital"
            />
            <button
              type="submit"
              class="icon d-flex align-center justify-center"
            >
              <img src="@/assets/image/icons/search-white.svg" alt="" />
            </button>
          </v-form>
        </div>
        <div class="contacts d-flex align-center justify-space-between">
          <div class="d-flex align-center mr-2">
            <img
              class="mr-2"
              src="@/assets/image/icons/call-green.svg"
              alt=""
            />
            <div class="">
              <p class="grey-color">Нужна помощь?</p>
              <p class="m">+7 707 990 90 90</p>
            </div>
          </div>
          <div v-if="!$auth.loggedIn" class="d-flex align-center h3">
            <button @click="openSignIn" class="mx-2">Вход</button>
            |
            <button @click="openSignUp" class="mx-2">Регистрация</button>
          </div>
          <div
            v-if="$auth.loggedIn"
            @mouseover="dropdown = true"
            @mouseleave="dropdown = false"
            class="d-flex align-center relative"
          >
            <nuxt-link
              class="mx-3 h3 profile-link"
              to="/profile/Person"
              @click.native="$store.commit('changeProfileMenu', 'personalInfo')"
            >
              Профиль
            </nuxt-link>

            <div v-if="dropdown && (isAdmin || isProvider)" class="dropdown">
              <div class="dropdown-wrapper">
                <nuxt-link
                  v-if="isAdmin"
                  class="mx-3 h3 profile-link"
                  to="/admin"
                >
                  Админ
                </nuxt-link>
                <nuxt-link
                  v-if="isProvider"
                  class="mx-3 h3 profile-link"
                  to="/provider"
                >
                  {{ $auth.user.user_type == "C" ? "Курьер" : "Поставщик" }}
                </nuxt-link>
              </div>
            </div>
          </div>
          <div v-if="$isClient()" class="cart ml-2">
            <nuxt-link :to="toBasket">
              <img src="@/assets/image/icons/shopping-cart-orange.svg" alt="" />
              <p v-if="$store.state.basketPrice > 0" class="count pm">
                {{ $price($store.state.basketPrice) }}
              </p>
            </nuxt-link>
          </div>
        </div>
      </v-row>
      <v-row class="mt-0 pa-4 align-center">
        <div
          @mouseover="catalog = true"
          @mouseleave="(catalog = false), (hover = 0)"
          @click="$router.push('/Products/')"
          class="catalog d-flex align-center pm"
        >
          <img class="mr-4" src="@/assets/image/icons/menu-white.svg" alt="" />
          Каталог
          <div v-if="catalog" class="categories">
            <div
              @mouseover="getPosition(item, index)"
              @click.stop
              @click="goToProducts(item, 'category')"
              class="item item-parent d-flex align-center"
              :class="[hover == item ? 'hover' : '']"
              v-for="(item, index) in categories"
              :key="index"
            >
              <img
                v-if="item.image"
                :src="item.image"
                alt=""
                width="24"
                height="24"
              />
              <img
                v-else
                src="@/assets/image/photos/default.svg"
                alt=""
                width="24"
                height="24"
              />
              <p class="ml-5">{{ item.name }}</p>
              <img
                class="arrow ml-auto"
                src="@/assets/image/icons/Arrow - Right 2.svg"
                alt=""
              />
            </div>
          </div>
          <div class="sub-categories">
            <div v-if="catalog && hover.sub_categories" class="">
              <div
                @mouseover="subhover = indexj + 1"
                @mouseleave="subhover = 0"
                @click.stop
                @click="goToProducts(itemj, 'sub_category')"
                class="item item-child d-flex align-center"
                :class="[subhover == indexj + 1 ? 'hover' : '']"
                v-for="(itemj, indexj) in hover.sub_categories"
                :key="indexj"
              >
                {{ itemj.name }}
              </div>
            </div>
          </div>
        </div>

        <div class="ml-3 type d-flex align-center">
          <div
            class="type-item type-item-left pm"
            @click="changeClientType('E')"
            :class="{
              'type-active type-active-left': $store.state.client_type == 'P'
            }"
          >
            Для бизнеса
          </div>
          <div
            class="type-item type-item-right pm"
            @click="changeClientType('I')"
            :class="{
              'type-active type-active-right': $store.state.client_type != 'P'
            }"
          >
            Для частных лиц
          </div>
        </div>
      </v-row>
    </v-container>
    <div class="mob">
      <v-container class="">
        <div class="d-flex align-center justify-space-between py-2">
          <div class="">
            <div class="d-flex flex-row align-center">
              <a href="/" class="logo">
                <img
                  src="@/assets/image/logo.svg"
                  width=""
                  height="30px"
                  alt=""
                />
              </a>
              <div
                @mouseover="hover_city = true"
                @mouseleave="hover_city = false"
                class="d-flex align-center ml-2 relative pb-1 bt-sm-0"
              >
                <img
                  src="@/assets/image/icons/location-green.svg"
                  alt=""
                  style="width: 16px; height: 16px"
                />
                <p class="grey-color pointer city">
                  г. {{ $store.state.my_city.name }}
                </p>

                <div v-if="hover_city" class="drop-down">
                  <div class="drop-down-wrapper">
                    <p
                      @click="changeCity(item)"
                      v-for="(item, index) in $store.state.all_cities"
                      :key="index"
                      class="pointer gilroy"
                    >
                      {{ item.name }}
                    </p>
                  </div>
                </div>
              </div>
            </div>
          </div>
          <div class="d-flex align-center justify-space-between">
            <svg
              @click="search_div = !search_div"
              class="ml-5 pointer"
              width="24"
              height="24"
              viewBox="0 0 24 24"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <path
                d="M10.8719 4.96798C7.61126 4.96798 4.96798 7.61126 4.96798 10.8719C4.96798 14.1326 7.61126 16.7758 10.8719 16.7758C14.1326 16.7758 16.7758 14.1326 16.7758 10.8719C16.7758 7.61126 14.1326 4.96798 10.8719 4.96798ZM3 10.8719C3 6.52437 6.52437 3 10.8719 3C15.2194 3 18.7438 6.52437 18.7438 10.8719C18.7438 12.691 18.1268 14.366 17.0906 15.699L20.7118 19.2358C21.0961 19.6201 21.0961 20.3275 20.7118 20.7118C20.3275 21.0961 19.6201 21.0961 19.2358 20.7118L15.699 17.0906C14.366 18.1268 12.691 18.7438 10.8719 18.7438C6.52437 18.7438 3 15.2194 3 10.8719Z"
                fill="#FF7A29"
              />
            </svg>

            <div v-if="$isClient()" class="d-flex align-center cart ml-5">
              <nuxt-link :to="toBasket" class="d-flex align-center">
                <svg
                  width="24"
                  height="24"
                  viewBox="0 0 24 24"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <path
                    d="M4.1421 3.99989L6.00913 16.1356C6.02271 16.2357 6.05113 16.3312 6.0921 16.4197C6.21543 16.6859 6.45246 16.8888 6.74088 16.966C6.82899 16.9897 6.92133 17.0015 7.01578 16.9999H18C18.4416 16.9999 18.8309 16.7102 18.9578 16.2872L21.9578 6.28724C22.0487 5.98447 21.991 5.65657 21.8023 5.40296C21.6136 5.14935 21.3161 4.99989 21 4.99989H6.31948L5.99058 2.86209C5.97826 2.7727 5.95413 2.68709 5.91981 2.60687C5.85751 2.4608 5.76213 2.33426 5.64429 2.23508C5.53497 2.14289 5.40561 2.07372 5.26367 2.03502C5.17434 2.01056 5.0806 1.9983 4.9847 1.99989H3C2.44772 1.99989 2 2.44761 2 2.99989C2 3.55218 2.44772 3.99989 3 3.99989H4.1421ZM7.85794 14.9999L6.62717 6.99989H19.656L17.256 14.9999H7.85794Z"
                    fill="#FF7A29"
                  />
                  <path
                    d="M10 19.9999C10 21.1045 9.10457 21.9999 8 21.9999C6.89543 21.9999 6 21.1045 6 19.9999C6 18.8953 6.89543 17.9999 8 17.9999C9.10457 17.9999 10 18.8953 10 19.9999Z"
                    fill="#FF7A29"
                  />
                  <path
                    d="M19 19.9999C19 21.1045 18.1046 21.9999 17 21.9999C15.8954 21.9999 15 21.1045 15 19.9999C15 18.8953 15.8954 17.9999 17 17.9999C18.1046 17.9999 19 18.8953 19 19.9999Z"
                    fill="#FF7A29"
                  />
                </svg>
                <p class="count pm ml-1">
                  {{ $price($store.state.basketPrice) }}
                </p>
              </nuxt-link>
            </div>
          </div>
        </div>
        <div @click="showUserTypeChange" class="user-type pointer mt-1">
          Каталог для
          {{ $store.state.client_type == "P" ? "бизнеса" : "частных лиц" }}
          <svg
            v-if="!$auth.loggedIn"
            class="ml-1 arrow"
            width="10"
            height="10"
            viewBox="0 0 10 10"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <path
              d="M2.20553 3.87204C2.36825 3.70932 2.63207 3.70932 2.79479 3.87204L5.00016 6.07741L7.20554 3.87204C7.36825 3.70932 7.63207 3.70932 7.79479 3.87204C7.95751 4.03476 7.95751 4.29858 7.79479 4.46129L5.29479 6.96129C5.13207 7.12401 4.86825 7.12401 4.70554 6.96129L2.20553 4.46129C2.04282 4.29858 2.04282 4.03476 2.20553 3.87204Z"
              fill="#FF7A29"
            />
          </svg>
        </div>
        <div v-if="search_div" class="mob_search search">
          <v-form @submit.prevent="searchIt">
            <input
              v-model="searching"
              type="text"
              class="search-bar"
              placeholder="Поиск по Baital"
            />
            <button
              type="submit"
              class="icon d-flex align-center justify-center"
            >
              <svg
                width="16"
                height="16"
                viewBox="0 0 16 16"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <mask
                  id="mask0"
                  style="mask-type: alpha"
                  maskUnits="userSpaceOnUse"
                  x="1"
                  y="1"
                  width="14"
                  height="14"
                >
                  <path
                    fill-rule="evenodd"
                    clip-rule="evenodd"
                    d="M1.3335 1.33325H14.318V14.3179H1.3335V1.33325Z"
                    fill="white"
                  />
                </mask>
                <g mask="url(#mask0)">
                  <path
                    fill-rule="evenodd"
                    clip-rule="evenodd"
                    d="M7.82616 2.33325C4.7975 2.33325 2.3335 4.79659 2.3335 7.82525C2.3335 10.8539 4.7975 13.3179 7.82616 13.3179C10.8542 13.3179 13.3182 10.8539 13.3182 7.82525C13.3182 4.79659 10.8542 2.33325 7.82616 2.33325ZM7.82616 14.3179C4.24616 14.3179 1.3335 11.4053 1.3335 7.82525C1.3335 4.24525 4.24616 1.33325 7.82616 1.33325C11.4062 1.33325 14.3182 4.24525 14.3182 7.82525C14.3182 11.4053 11.4062 14.3179 7.82616 14.3179Z"
                    fill="#FF7A29"
                  />
                </g>
                <mask
                  id="mask1"
                  style="mask-type: alpha"
                  maskUnits="userSpaceOnUse"
                  x="11"
                  y="11"
                  width="4"
                  height="5"
                >
                  <path
                    fill-rule="evenodd"
                    clip-rule="evenodd"
                    d="M11.4937 11.8044H14.843V15.1476H11.4937V11.8044Z"
                    fill="white"
                  />
                </mask>
                <g mask="url(#mask1)">
                  <path
                    fill-rule="evenodd"
                    clip-rule="evenodd"
                    d="M14.3432 15.1476C14.2158 15.1476 14.0878 15.0989 13.9898 15.0016L11.6405 12.6589C11.4452 12.4636 11.4445 12.1469 11.6398 11.9516C11.8345 11.7549 12.1512 11.7563 12.3472 11.9503L14.6965 14.2936C14.8918 14.4889 14.8925 14.8049 14.6972 15.0003C14.5998 15.0989 14.4712 15.1476 14.3432 15.1476Z"
                    fill="#FF7A29"
                  />
                </g>
              </svg>
            </button>
          </v-form>
        </div>
        <div v-if="user_type_div" class="mob_search search">
          <div class="type d-flex align-center">
            <div
              class="type-item type-item-left pm"
              @click="changeClientType('E')"
              :class="{
                'type-active type-active-left': $store.state.client_type == 'P'
              }"
            >
              Для бизнеса
            </div>
            <div
              class="type-item type-item-right pm"
              @click="changeClientType('I')"
              :class="{
                'type-active type-active-right': $store.state.client_type != 'P'
              }"
            >
              Для частных лиц
            </div>
          </div>
        </div>
      </v-container>
    </div>

    <v-dialog
      v-model="login_modal"
      width="534"
      :fullscreen="$vuetify.breakpoint.xsOnly"
    >
      <v-card class="py-11 px-14">
        <div class="d-flex btns mx-auto">
          <button
            class="green-btn-outline"
            @click="openSignUp"
            :class="{ 'green-btn-outline-active': sign == 'up' }"
          >
            Зарегистрироваться
          </button>
          <button
            class="green-btn-outline"
            @click="openSignIn"
            :class="{ 'green-btn-outline-active': sign == 'in' }"
          >
            Войти
          </button>
        </div>
        <div v-if="sign == 'in'" class="">
          <h2 class="fw400 mt-9">Войти</h2>
          <h3 class="grey-color fw400">Добро пожаловать в сервис покупок</h3>

          <v-form ref="signInForm" @submit.prevent="signIn" class="mt-7">
            <p class="fw500 mt-3">Номер телефона</p>
            <div class="d-flex">
              <div class="masks my-input-prepend mr-2">
                <v-select
                  :items="phone_masks"
                  v-model="selected_mask"
                  class="my-input mt-2"
                  solo
                  hide-details
                >
                </v-select>
              </div>
              <v-text-field
                class="my-input mt-2"
                v-model="form.phone_number"
                solo
                :placeholder="selectedMask"
                v-mask="selectedMask"
                :rules="[rules.required]"
              >
              </v-text-field>
            </div>

            <p class="fw500 mt-3">Пароль</p>
            <v-text-field
              class="my-input mt-2"
              v-model="form.password"
              placeholder="Пароль"
              solo
              :rules="[
                rules.required,
                rules.password,
                iscorrect || error_message
              ]"
              @input="defaultErrors"
              :type="showPass ? 'password' : 'text'"
            >
              <template v-slot:append>
                <svg
                  @click="showPass = !showPass"
                  v-if="!showPass"
                  class="ml-2 pointer"
                  width="24"
                  height="24"
                  viewBox="0 0 24 24"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <g clip-path="url(#clip0)">
                    <path
                      d="M18.9402 13.2995C17.7137 11.0787 15.0442 9.0625 12.0005 9.0625C8.9354 9.0625 6.27371 11.1033 5.06074 13.2995C4.9804 13.445 4.9804 13.6175 5.06074 13.763C6.2873 15.9838 8.95676 18 12.0005 18C15.4469 18 17.9873 15.4883 18.9402 13.763C19.0205 13.6175 19.0205 13.445 18.9402 13.2995ZM12.0005 16.9844C9.51832 16.9844 7.43478 15.4531 6.17746 13.5312C7.42086 11.6306 9.49776 10.0781 12.0005 10.0781C14.4925 10.0781 16.5732 11.6202 17.8235 13.5312C16.5604 15.4619 14.4685 16.9844 12.0005 16.9844ZM5.17282 7.82273C5.37489 7.61429 5.72071 7.59749 5.94517 7.78515L7.16317 8.80349C7.38761 8.99118 7.40574 9.31224 7.20364 9.52067C7.00154 9.72913 6.65573 9.74589 6.43129 9.55825L5.21329 8.53989C4.98885 8.35225 4.97072 8.03116 5.17282 7.82273ZM11.4536 7.53906V5.50781C11.4536 5.22737 11.6984 5 12.0005 5C12.3025 5 12.5473 5.22737 12.5473 5.50781V7.53906C12.5473 7.8195 12.3025 8.04688 12.0005 8.04688C11.6984 8.04688 11.4536 7.8195 11.4536 7.53906ZM7.98641 6.40804C7.86356 6.15182 7.98764 5.85165 8.26357 5.73757C8.53952 5.62349 8.86275 5.73871 8.98561 5.99493L9.82197 7.73927C9.94483 7.99546 9.82074 8.29565 9.54481 8.40973C9.26968 8.52346 8.94604 8.40938 8.82278 8.15237L7.98641 6.40804ZM16.7973 9.52067C16.5952 9.31227 16.6133 8.99118 16.8378 8.80349L18.0558 7.78515C18.2802 7.59749 18.626 7.61429 18.8281 7.82273C19.0302 8.03113 19.0121 8.35222 18.7877 8.53989L17.5697 9.55825C17.3451 9.74594 16.9994 9.72905 16.7973 9.52067ZM14.179 7.73927L15.0153 5.99493C15.1382 5.73871 15.4614 5.62349 15.7374 5.73757C16.0133 5.85165 16.1374 6.15182 16.0145 6.40804L15.1781 8.15235C15.0547 8.40973 14.7308 8.52328 14.4561 8.40973C14.1802 8.29565 14.0561 7.99548 14.179 7.73927ZM12.0005 11.0366C10.5191 11.0366 9.31395 12.1557 9.31395 13.5312C9.31395 14.9068 10.5191 16.0259 12.0005 16.0259C13.4818 16.0259 14.687 14.9068 14.687 13.5312C14.687 12.1557 13.4818 11.0366 12.0005 11.0366ZM12.0005 15.0103C11.1222 15.0103 10.4077 14.3468 10.4077 13.5312C10.4077 12.7157 11.1222 12.0522 12.0005 12.0522C12.8787 12.0522 13.5932 12.7157 13.5932 13.5312C13.5932 14.3468 12.8787 15.0103 12.0005 15.0103Z"
                      fill="#313131"
                    />
                  </g>
                  <defs>
                    <clipPath id="clip0">
                      <rect
                        width="14"
                        height="13"
                        fill="white"
                        transform="translate(5 5)"
                      />
                    </clipPath>
                  </defs>
                </svg>
                <svg
                  @click="showPass = !showPass"
                  v-else
                  class="ml-2 pointer"
                  width="24"
                  height="24"
                  viewBox="0 0 24 24"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <g clip-path="url(#clip0)">
                    <mask
                      id="mask0"
                      mask-type="alpha"
                      maskUnits="userSpaceOnUse"
                      x="5"
                      y="9"
                      width="14"
                      height="10"
                    >
                      <path d="M5 19H19V9.8125H5V19Z" fill="#C4C4C4" />
                    </mask>
                    <g mask="url(#mask0)">
                      <path
                        d="M18.9402 10.062C17.7136 12.4537 15.0442 14.625 12.0005 14.625C8.9354 14.625 6.27371 12.4272 5.06074 10.062C4.9804 9.90539 4.9804 9.71961 5.06074 9.56293C6.2873 7.17134 8.95676 5 12.0005 5C15.4469 5 17.9873 7.7049 18.9402 9.56296C19.0205 9.71961 19.0205 9.90539 18.9402 10.062ZM12.0005 6.09375C9.51832 6.09375 7.43478 7.74277 6.17746 9.8125C7.42086 11.8593 9.49776 13.5312 12.0005 13.5312C14.4925 13.5312 16.5732 11.8705 17.8235 9.8125C16.5604 7.73334 14.4685 6.09375 12.0005 6.09375ZM5.17282 15.9601C5.37489 16.1846 5.72071 16.2027 5.94517 16.0006L7.16317 14.9039C7.38761 14.7018 7.40574 14.356 7.20364 14.1316C7.00154 13.9071 6.65573 13.889 6.43129 14.0911L5.21329 15.1878C4.98885 15.3899 4.97072 15.7357 5.17282 15.9601ZM11.4536 16.2656V18.4531C11.4536 18.7551 11.6984 19 12.0005 19C12.3025 19 12.5473 18.7551 12.5473 18.4531V16.2656C12.5473 15.9636 12.3025 15.7188 12.0005 15.7188C11.6984 15.7188 11.4536 15.9636 11.4536 16.2656ZM7.98641 17.4837C7.86356 17.7596 7.98764 18.0828 8.26357 18.2057C8.53952 18.3285 8.86275 18.2045 8.98561 17.9285L9.82197 16.05C9.94483 15.7741 9.82074 15.4508 9.54481 15.328C9.26968 15.2055 8.94604 15.3284 8.82278 15.6051L7.98641 17.4837ZM16.7973 14.1316C16.5952 14.356 16.6133 14.7018 16.8378 14.9039L18.0558 16.0006C18.2802 16.2027 18.626 16.1846 18.8281 15.9601C19.0302 15.7357 19.0121 15.3899 18.7877 15.1878L17.5697 14.0911C17.3451 13.889 16.9994 13.9072 16.7973 14.1316ZM14.179 16.05L15.0153 17.9285C15.1382 18.2045 15.4614 18.3285 15.7374 18.2057C16.0133 18.0828 16.1374 17.7596 16.0145 17.4837L15.1781 15.6052C15.0547 15.328 14.7308 15.2057 14.4561 15.328C14.1802 15.4508 14.0561 15.7741 14.179 16.05Z"
                        fill="#313131"
                      />
                    </g>
                  </g>
                  <defs>
                    <clipPath id="clip0">
                      <rect
                        width="14"
                        height="14"
                        fill="white"
                        transform="matrix(1 0 0 -1 5 19)"
                      />
                    </clipPath>
                  </defs>
                </svg>
              </template>
            </v-text-field>
            <p @click="forgot_modal = true" class="forgot-pass">
              Забыли пароль?
            </p>
            <button type="submit" class="green-btn submit mx-auto mt-12">
              Войти
            </button>
          </v-form>
        </div>
        <div v-else class="">
          <h2 class="fw400 mt-9">Регистрация</h2>
          <h3 class="grey-color fw400">Добро пожаловать в сервис покупок</h3>

          <v-form ref="signUpForm" @submit.prevent="signUp" class="mt-7">
            <p class="fw500 mt-3">Страна</p>
            <v-select
              class="my-input mt-2"
              :items="countries"
              item-text="name"
              item-value="id"
              v-model="form.country"
              placeholder="Выбирете страну"
              solo
              :rules="[rules.required]"
              no-data-text="Ничего не найдено"
              @input="handleInput"
            ></v-select>

            <p class="fw500 mt-3">Город</p>
            <v-select
              class="my-input mt-2"
              :items="cities"
              item-text="name"
              item-value="id"
              v-model="form.city"
              placeholder="Выбирете город"
              solo
              :rules="[chooseCountry || 'Выберите страну', rules.required]"
              :readonly="form.country ? false : true"
              no-data-text="Ничего не найдено"
            ></v-select>

            <p class="fw500 mt-3">Номер телефона</p>
            <v-text-field
              class="my-input mt-2"
              v-model="form.phone_number"
              placeholder="+7 7"
              solo
              v-mask="mask"
              :rules="[
                chooseCountry || 'Выберите страну',
                rules.required,
                e_phone_number || em_phone_number
              ]"
              :readonly="form.country ? false : true"
            ></v-text-field>

            <p class="fw500 mt-3">Пароль</p>
            <v-text-field
              class="my-input mt-2"
              v-model="form.password"
              placeholder="Пароль"
              solo
              :rules="[
                rules.required,
                rules.password,
                e_password || em_password
              ]"
              :type="showPass ? 'password' : 'text'"
            >
              <template v-slot:append>
                <svg
                  @click="showPass = !showPass"
                  v-if="!showPass"
                  class="ml-2 pointer"
                  width="24"
                  height="24"
                  viewBox="0 0 24 24"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <g clip-path="url(#clip0)">
                    <path
                      d="M18.9402 13.2995C17.7137 11.0787 15.0442 9.0625 12.0005 9.0625C8.9354 9.0625 6.27371 11.1033 5.06074 13.2995C4.9804 13.445 4.9804 13.6175 5.06074 13.763C6.2873 15.9838 8.95676 18 12.0005 18C15.4469 18 17.9873 15.4883 18.9402 13.763C19.0205 13.6175 19.0205 13.445 18.9402 13.2995ZM12.0005 16.9844C9.51832 16.9844 7.43478 15.4531 6.17746 13.5312C7.42086 11.6306 9.49776 10.0781 12.0005 10.0781C14.4925 10.0781 16.5732 11.6202 17.8235 13.5312C16.5604 15.4619 14.4685 16.9844 12.0005 16.9844ZM5.17282 7.82273C5.37489 7.61429 5.72071 7.59749 5.94517 7.78515L7.16317 8.80349C7.38761 8.99118 7.40574 9.31224 7.20364 9.52067C7.00154 9.72913 6.65573 9.74589 6.43129 9.55825L5.21329 8.53989C4.98885 8.35225 4.97072 8.03116 5.17282 7.82273ZM11.4536 7.53906V5.50781C11.4536 5.22737 11.6984 5 12.0005 5C12.3025 5 12.5473 5.22737 12.5473 5.50781V7.53906C12.5473 7.8195 12.3025 8.04688 12.0005 8.04688C11.6984 8.04688 11.4536 7.8195 11.4536 7.53906ZM7.98641 6.40804C7.86356 6.15182 7.98764 5.85165 8.26357 5.73757C8.53952 5.62349 8.86275 5.73871 8.98561 5.99493L9.82197 7.73927C9.94483 7.99546 9.82074 8.29565 9.54481 8.40973C9.26968 8.52346 8.94604 8.40938 8.82278 8.15237L7.98641 6.40804ZM16.7973 9.52067C16.5952 9.31227 16.6133 8.99118 16.8378 8.80349L18.0558 7.78515C18.2802 7.59749 18.626 7.61429 18.8281 7.82273C19.0302 8.03113 19.0121 8.35222 18.7877 8.53989L17.5697 9.55825C17.3451 9.74594 16.9994 9.72905 16.7973 9.52067ZM14.179 7.73927L15.0153 5.99493C15.1382 5.73871 15.4614 5.62349 15.7374 5.73757C16.0133 5.85165 16.1374 6.15182 16.0145 6.40804L15.1781 8.15235C15.0547 8.40973 14.7308 8.52328 14.4561 8.40973C14.1802 8.29565 14.0561 7.99548 14.179 7.73927ZM12.0005 11.0366C10.5191 11.0366 9.31395 12.1557 9.31395 13.5312C9.31395 14.9068 10.5191 16.0259 12.0005 16.0259C13.4818 16.0259 14.687 14.9068 14.687 13.5312C14.687 12.1557 13.4818 11.0366 12.0005 11.0366ZM12.0005 15.0103C11.1222 15.0103 10.4077 14.3468 10.4077 13.5312C10.4077 12.7157 11.1222 12.0522 12.0005 12.0522C12.8787 12.0522 13.5932 12.7157 13.5932 13.5312C13.5932 14.3468 12.8787 15.0103 12.0005 15.0103Z"
                      fill="#313131"
                    />
                  </g>
                  <defs>
                    <clipPath id="clip0">
                      <rect
                        width="14"
                        height="13"
                        fill="white"
                        transform="translate(5 5)"
                      />
                    </clipPath>
                  </defs>
                </svg>
                <svg
                  @click="showPass = !showPass"
                  v-else
                  class="ml-2 pointer"
                  width="24"
                  height="24"
                  viewBox="0 0 24 24"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <g clip-path="url(#clip0)">
                    <mask
                      id="mask0"
                      mask-type="alpha"
                      maskUnits="userSpaceOnUse"
                      x="5"
                      y="9"
                      width="14"
                      height="10"
                    >
                      <path d="M5 19H19V9.8125H5V19Z" fill="#C4C4C4" />
                    </mask>
                    <g mask="url(#mask0)">
                      <path
                        d="M18.9402 10.062C17.7136 12.4537 15.0442 14.625 12.0005 14.625C8.9354 14.625 6.27371 12.4272 5.06074 10.062C4.9804 9.90539 4.9804 9.71961 5.06074 9.56293C6.2873 7.17134 8.95676 5 12.0005 5C15.4469 5 17.9873 7.7049 18.9402 9.56296C19.0205 9.71961 19.0205 9.90539 18.9402 10.062ZM12.0005 6.09375C9.51832 6.09375 7.43478 7.74277 6.17746 9.8125C7.42086 11.8593 9.49776 13.5312 12.0005 13.5312C14.4925 13.5312 16.5732 11.8705 17.8235 9.8125C16.5604 7.73334 14.4685 6.09375 12.0005 6.09375ZM5.17282 15.9601C5.37489 16.1846 5.72071 16.2027 5.94517 16.0006L7.16317 14.9039C7.38761 14.7018 7.40574 14.356 7.20364 14.1316C7.00154 13.9071 6.65573 13.889 6.43129 14.0911L5.21329 15.1878C4.98885 15.3899 4.97072 15.7357 5.17282 15.9601ZM11.4536 16.2656V18.4531C11.4536 18.7551 11.6984 19 12.0005 19C12.3025 19 12.5473 18.7551 12.5473 18.4531V16.2656C12.5473 15.9636 12.3025 15.7188 12.0005 15.7188C11.6984 15.7188 11.4536 15.9636 11.4536 16.2656ZM7.98641 17.4837C7.86356 17.7596 7.98764 18.0828 8.26357 18.2057C8.53952 18.3285 8.86275 18.2045 8.98561 17.9285L9.82197 16.05C9.94483 15.7741 9.82074 15.4508 9.54481 15.328C9.26968 15.2055 8.94604 15.3284 8.82278 15.6051L7.98641 17.4837ZM16.7973 14.1316C16.5952 14.356 16.6133 14.7018 16.8378 14.9039L18.0558 16.0006C18.2802 16.2027 18.626 16.1846 18.8281 15.9601C19.0302 15.7357 19.0121 15.3899 18.7877 15.1878L17.5697 14.0911C17.3451 13.889 16.9994 13.9072 16.7973 14.1316ZM14.179 16.05L15.0153 17.9285C15.1382 18.2045 15.4614 18.3285 15.7374 18.2057C16.0133 18.0828 16.1374 17.7596 16.0145 17.4837L15.1781 15.6052C15.0547 15.328 14.7308 15.2057 14.4561 15.328C14.1802 15.4508 14.0561 15.7741 14.179 16.05Z"
                        fill="#313131"
                      />
                    </g>
                  </g>
                  <defs>
                    <clipPath id="clip0">
                      <rect
                        width="14"
                        height="14"
                        fill="white"
                        transform="matrix(1 0 0 -1 5 19)"
                      />
                    </clipPath>
                  </defs>
                </svg>
              </template>
            </v-text-field>

            <div class="mt-3 d-flex mx-auto type-user">
              <button
                type="button"
                @click="form.user_type = 'E'"
                class="mortal"
                :class="{ 'mortal-active': form.user_type == 'E' }"
              >
                Я предприниматель
              </button>
              <button
                type="button"
                @click="form.user_type = 'I'"
                class="mortal"
                :class="{ 'mortal-active': form.user_type == 'I' }"
              >
                Я частное лицо
              </button>
            </div>
            <button type="submit" class="green-btn submit mx-auto mt-12">
              Зарегистрироваться
            </button>
          </v-form>
        </div>
      </v-card>
    </v-dialog>
    <v-dialog
      v-model="verify_modal"
      persistent
      width="427"
      :fullscreen="$vuetify.breakpoint.xsOnly"
    >
      <v-card class="pa-7 text-center my-modal">
        <svg
          class="pointer close"
          @click="verify_modal = false"
          width="30"
          height="30"
          viewBox="0 0 30 30"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
        >
          <path
            d="M15 5C9.47715 5 5 9.47715 5 15C5 20.5228 9.47715 25 15 25C20.5228 25 25 20.5228 25 15C25 9.47715 20.5228 5 15 5ZM2.5 15C2.5 8.09644 8.09644 2.5 15 2.5C21.9036 2.5 27.5 8.09644 27.5 15C27.5 21.9036 21.9036 27.5 15 27.5C8.09644 27.5 2.5 21.9036 2.5 15ZM9.74112 9.74112C10.2293 9.25296 11.0207 9.25296 11.5089 9.74112L15 13.2322L18.4911 9.74112C18.9793 9.25296 19.7707 9.25296 20.2589 9.74112C20.747 10.2293 20.747 11.0207 20.2589 11.5089L16.7678 15L20.2589 18.4911C20.747 18.9793 20.747 19.7707 20.2589 20.2589C19.7707 20.747 18.9793 20.747 18.4911 20.2589L15 16.7678L11.5089 20.2589C11.0207 20.747 10.2293 20.747 9.74112 20.2589C9.25296 19.7707 9.25296 18.9793 9.74112 18.4911L13.2322 15L9.74112 11.5089C9.25296 11.0207 9.25296 10.2293 9.74112 9.74112Z"
            fill="#FF7A29"
          />
        </svg>
        <h2>Сменить номер</h2>

        <h3 class="fw400 mt-4">
          Код отправлен на номер <br />
          {{ this.form.phone_number }}, введите код!
        </h3>
        <v-form @submit.prevent="phoneActivation" ref="verifyRef" class="mt-5">
          <p class="fw500 mt-3 text-left">Введите код</p>
          <v-text-field
            class="my-input mt-2"
            v-model="verifyForm.secret_code"
            solo
            type="number"
            placeholder="Введите код"
            :rules="[rules.required]"
            hide-details
          ></v-text-field>

          <p
            @click="resendVerification"
            type="button"
            class="s orange-color text-right pointer"
          >
            переотправить
          </p>

          <button type="submit" class="orange-btn mx-auto mt-7">
            Отправить
          </button>
        </v-form>
      </v-card>
    </v-dialog>
    <v-dialog
      v-model="forgot_modal"
      width="427"
      :fullscreen="$vuetify.breakpoint.xsOnly"
    >
      <v-card class="pa-7 text-center relative">
        <svg
          class="pointer close"
          @click="forgot_modal = false"
          width="30"
          height="30"
          viewBox="0 0 30 30"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
        >
          <path
            d="M15 5C9.47715 5 5 9.47715 5 15C5 20.5228 9.47715 25 15 25C20.5228 25 25 20.5228 25 15C25 9.47715 20.5228 5 15 5ZM2.5 15C2.5 8.09644 8.09644 2.5 15 2.5C21.9036 2.5 27.5 8.09644 27.5 15C27.5 21.9036 21.9036 27.5 15 27.5C8.09644 27.5 2.5 21.9036 2.5 15ZM9.74112 9.74112C10.2293 9.25296 11.0207 9.25296 11.5089 9.74112L15 13.2322L18.4911 9.74112C18.9793 9.25296 19.7707 9.25296 20.2589 9.74112C20.747 10.2293 20.747 11.0207 20.2589 11.5089L16.7678 15L20.2589 18.4911C20.747 18.9793 20.747 19.7707 20.2589 20.2589C19.7707 20.747 18.9793 20.747 18.4911 20.2589L15 16.7678L11.5089 20.2589C11.0207 20.747 10.2293 20.747 9.74112 20.2589C9.25296 19.7707 9.25296 18.9793 9.74112 18.4911L13.2322 15L9.74112 11.5089C9.25296 11.0207 9.25296 10.2293 9.74112 9.74112Z"
            fill="#FF7A29"
          />
        </svg>

        <h2>Забыли пароль?</h2>

        <v-form
          @submit.prevent="submitForgotPassword"
          ref="forgotRef"
          class="mt-5 text-left"
        >
          <p class="fw600">Введите номер</p>
          <p class="small grey-color">
            Новый пароль придет к вам в виде сообщения
          </p>
          <v-text-field
            class="my-input mt-3"
            v-model="forgotForm.phone_number"
            solo
            placeholder="Текущий номер"
            :rules="[rules.required]"
            hide-details
          ></v-text-field>

          <button type="submit" class="orange-btn mx-auto mt-7">
            Отправить
          </button>
        </v-form>
      </v-card>
    </v-dialog>
    <v-dialog
      v-model="verify_forgot_modal"
      width="427"
      :fullscreen="$vuetify.breakpoint.xsOnly"
    >
      <v-card class="pa-7 text-center relative">
        <svg
          class="pointer close"
          @click="verify_forgot_modal = false"
          width="30"
          height="30"
          viewBox="0 0 30 30"
          fill="none"
          xmlns="http://www.w3.org/2000/svg"
        >
          <path
            d="M15 5C9.47715 5 5 9.47715 5 15C5 20.5228 9.47715 25 15 25C20.5228 25 25 20.5228 25 15C25 9.47715 20.5228 5 15 5ZM2.5 15C2.5 8.09644 8.09644 2.5 15 2.5C21.9036 2.5 27.5 8.09644 27.5 15C27.5 21.9036 21.9036 27.5 15 27.5C8.09644 27.5 2.5 21.9036 2.5 15ZM9.74112 9.74112C10.2293 9.25296 11.0207 9.25296 11.5089 9.74112L15 13.2322L18.4911 9.74112C18.9793 9.25296 19.7707 9.25296 20.2589 9.74112C20.747 10.2293 20.747 11.0207 20.2589 11.5089L16.7678 15L20.2589 18.4911C20.747 18.9793 20.747 19.7707 20.2589 20.2589C19.7707 20.747 18.9793 20.747 18.4911 20.2589L15 16.7678L11.5089 20.2589C11.0207 20.747 10.2293 20.747 9.74112 20.2589C9.25296 19.7707 9.25296 18.9793 9.74112 18.4911L13.2322 15L9.74112 11.5089C9.25296 11.0207 9.25296 10.2293 9.74112 9.74112Z"
            fill="#FF7A29"
          />
        </svg>

        <v-form
          @submit.prevent="submitForgotVerifyPassword"
          ref="forgotVerifyRef"
          class="mt-5 text-left"
        >
          <p class="fw600">Введите Код</p>

          <v-text-field
            class="my-input mt-3"
            v-model="forgotForm.secret_code"
            solo
            placeholder="Код"
            :rules="[rules.required]"
            type="number"
            hide-details
          ></v-text-field>

          <p class="fw600">Новый пароль</p>
          <v-text-field
            class="my-input mt-3"
            v-model="forgotForm.new_password"
            solo
            placeholder="новый пароль"
            type="password"
            :rules="[rules.required, rules.password]"
            hide-details
          ></v-text-field>

          <button type="submit" class="orange-btn mx-auto mt-7">
            Отправить
          </button>
        </v-form>
      </v-card>
    </v-dialog>
  </div>
</template>

<script>
import login from "@/mixins/login";
export default {
  mixins: [login],
  data: () => ({
    user_type_div: false,
    search_div: false,
    hover_city: false,
    dropdown: false,
    searching: "",
    catalog: false,
    hover: 0,
    subhover: 0,
    categories: []
  }),
  watch: {
    "$auth.loggedIn"() {
      if (this.$auth.loggedIn) this.sessionAttach();
      this.$store.dispatch("fetchBasket");
    },
    "$route.path"(newVal, oldVal) {
      if ("/Products" != newVal) this.searching = "";
    }
  },
  mounted() {
    this.$store.dispatch("fetchBasket");
    this.fetchCategories();
  },
  computed: {
    toBasket() {
      if (this.$store.state.basketPrice == 0) return "/";
      return "/Basket";
    },
    isAdmin() {
      if (this.$auth.user.is_superuser) return true;
      else if (this.$auth.user.is_staff) return true;
      else false;
    },
    isProvider() {
      if (
        this.$auth.user.user_type == "P" ||
        this.$auth.user.user_type == "C" ||
        this.$auth.user.user_type == "S"
      )
        return true;
      return false;
    }
  },
  methods: {
    showUserTypeChange() {
      if (!this.$auth.loggedIn) this.user_type_div = !this.user_type_div;
    },
    getPosition(item, index) {
      this.hover = item;
      const category = document.querySelectorAll(".item-parent")[index];
      category.addEventListener("mousemove", this.setPosToSubCategory);
    },
    setPosToSubCategory(event) {
      const category = document.querySelector(".categories");
      const sub_category = document.querySelector(".sub-categories");
      let mouse_pos =
        event.pageY - category.getBoundingClientRect().top - window.scrollY;
      let pos = mouse_pos - Math.ceil(mouse_pos % 50);
      sub_category.style.top = `${pos}px`;
    },
    searchIt() {
      this.$router.push({
        path: "/Products",
        query: { search: this.searching }
      });
      this.search_div = false;
    },
    changeCity(item) {
      this.$store.commit("setMyCity", item);
      this.hover_city = false;
    },
    async sessionAttach() {
      let body = {
        session_key: localStorage.session_key
      };
      if (
        this.$auth.user.user_type == "E" ||
        this.$auth.user.user_type == "I"
      ) {
        await this.$axios.$post(`orders/attach/`, body).catch(err => {
          console.log(err);
          // let error = Object.values(err.response.data).join(", ");
          // this.$notifier.showMessage({ color: "error", text: error });
        });
      }
    },
    dropDown() {
      if (this.$auth.loggedIn) {
        if (
          this.$auth.user.user_type != "E" &&
          this.$auth.user.user_type != "I"
        ) {
          this.dropdown = true;
        }
      } else this.dropdown = false;
    },
    changeClientType(value) {
      if (!this.$auth.loggedIn) this.$store.commit("setClientType", value);
      this.user_type_div = false;
    },
    goToProducts(item, type) {
      let query = {};
      if (type == "category") query.category = [item.id];
      else {
        query.category = [item.category];
        query.sub_category = [item.id];
      }
      this.$router.push({
        path: "/Products",
        query
      });
    },
    async fetchCategories() {
      await this.$axios.$get(`categories/`).then(res => {
        this.categories = res.results;
      });
    }
  }
};
</script>

<style scoped lang="scss">
.drop-down {
  position: absolute;
  width: 134px;
  top: 100%;
  left: 0;
  background: #fff;
  box-shadow: 0px 10px 15px rgba(138, 149, 158, 0.15);
  padding-right: 2px;
  padding-top: 7px;
  z-index: 100;
  &-wrapper {
    height: 249px;
    overflow-y: scroll;
    &::-webkit-scrollbar {
      background: transparent;
      margin-right: 10px;
      width: 2px;
      height: 75px;
    }
    &::-webkit-scrollbar-thumb {
      width: 2px;
      height: 75px;
      background: #c4c4c4;
      border-radius: 5px;
    }
  }
  p {
    height: 30px;
    padding: 0 15px;
    border-bottom: 1px solid #eeee;
    font-weight: normal;
    font-size: 14px;
    line-height: 17px;
    color: #313131;
    background: #fefefe;
    display: flex;
    align-items: center;
    transition: 0.22s;

    &:hover {
      background: #eeeeee;
    }
  }
}
.dropdown {
  position: absolute;
  top: 30px;
  left: 50%;
  z-index: 10;
  transform: translateX(-25%);
  cursor: pointer;

  &-wrapper {
    padding: 4px 26px;
    border: 1px solid #e4e4e4;
    box-sizing: border-box;
    border-radius: 5px;
    background: #fff;
    transform: translateX(-25%);

    &:after,
    &:before {
      content: " ";
      position: absolute;
      bottom: 100%;
      left: 50%;
      margin-left: -10px;
      border-width: 10px;
      border-style: solid;
      border-top: 10px solid transparent;
      border-right: 10px solid transparent;
      border-bottom: 10px solid #c4c4c4;
      border-left: 10px solid transparent;
    }
    &:after {
      border-bottom: 9px solid white;
      top: -19px;
    }
  }
}
.header {
  box-shadow: 0px 3px 15px rgba(138, 149, 158, 0.1);
  position: fixed;
  top: 0;
  left: 0;
  width: 100%;
  z-index: 100;
  background: #fff;
}
.profile-link {
  text-decoration: none;
  color: $black-color;
  &:hover {
    color: $orange-color;
  }
}
.logo {
  text-decoration: none;
  font-weight: bold;
  font-size: 30px;
  line-height: 37px;
  color: $black-color;
}
.grey-color {
  color: $grey-color;
}
.orange-color {
  color: $orange-color;
}

.cart {
  position: relative;
  min-width: 62px;
  height: 41px;
  cursor: pointer;

  .count {
    position: absolute;
    display: inline;
    right: -20px;
    top: -10px;
    padding: 2px 8px;
    color: #fff;
    background: $orange-color;
    border-radius: 10px;
    font-weight: normal;
    font-size: 14px;
    line-height: 18px;
  }
}
.contacts {
  @media (max-width: 1185px) {
    margin-top: 20px;
    margin-left: auto;
  }
}
.search {
  width: 100%;
  max-width: 480px;
  position: relative;

  &-bar {
    width: 100%;
    height: 40px;
    border: 1px solid #52b059;
    box-sizing: border-box;
    border-radius: 3px;
    padding: 13px 50px 9px 17px;

    &::placeholder {
      color: $grey-color;
    }
    &:focus {
      outline: none;
    }
  }
  .icon {
    position: absolute;
    right: 0;
    top: 0;
    width: 40px;
    height: 40px;
    background: #52b059;
    transition: 0.22s;
    cursor: pointer;

    &:hover {
      opacity: 0.6;
    }
  }
}

.catalog {
  display: flex;
  justify-content: center;
  align-items: center;
  height: 24px;
  padding: 0 26px 0 6px;
  color: white;
  background: #52b059;
  border-radius: 3px;

  cursor: pointer;
  position: relative;

  .categories {
    position: absolute;
    width: 396px;
    left: 0;
    top: 100%;
    z-index: 10;
    box-shadow: 0px 10px 15px rgba(138, 149, 158, 0.15);
    max-height: 420px;
    overflow-y: scroll;
    overflow-x: hidden;
    &::-webkit-scrollbar {
      width: 0;
      background: transparent;
    }
    &::-webkit-scrollbar-thumb {
      width: 0;
      background: transparent;
    }
  }
  .sub-categories {
    position: absolute;
    left: 396px;
    top: 0;
    transform: translateY(24px);
    width: 384px;
    max-height: 420px;
    overflow-y: scroll;
    overflow-x: hidden;
    background: #fbfbfb;
    box-shadow: 0px 10px 15px rgba(138, 149, 158, 0.15);
    z-index: 11;

    &::-webkit-scrollbar {
      width: 0;
      background: transparent;
    }
    &::-webkit-scrollbar-thumb {
      width: 0;
      background: transparent;
    }
  }
  .item {
    height: 50px;
    width: 100%;
    max-width: 396px;
    padding-left: 24px;
    padding-right: 22px;
    background: #fcfcfc;
  }
  .hover {
    cursor: pointer;
    color: white;
    background: $orange-color;
    p {
      color: white;
    }
  }
}
.empty-space {
  height: 10px;
  width: 100px;
  background: transparent;
}
.type {
  transition: 0.22s;
  color: white;
  &-item {
    display: flex;
    justify-content: center;
    align-items: center;
    height: 24px;
    padding: 0 18px;
    border: 1px solid #ff7a29;
    box-sizing: border-box;
    border-radius: 3px;

    cursor: pointer;
    @media (max-width: 600px) {
      width: 100%;
    }
    &-left {
      border-right: none;
      border-top-right-radius: 0;
      border-bottom-right-radius: 0;
    }
    &-right {
      border-left: none;
      border-top-left-radius: 0;
      border-bottom-left-radius: 0;
    }
  }
  &-active {
    background: #ff7a29;
    color: white;

    &-left {
      border-top-right-radius: 3px;
      border-bottom-right-radius: 3px;
    }
    &-right {
      border-top-left-radius: 3px;
      border-bottom-left-radius: 3px;
    }
  }
}

.btns {
  width: 100%;
  max-width: 345px;
  border: 1px solid $green-color;
  border-radius: 5px;
  button {
    height: 35px;
    &:first-child {
      border-top-right-radius: 0px;
      border-bottom-right-radius: 0px;
    }
    &:last-child {
      border-top-left-radius: 0px;
      border-bottom-left-radius: 0px;
    }
  }
  .green-btn-outline {
    border: none;

    color: $black-color;
    &:hover {
      background: $green-color;
      color: #fff;
    }
    &-active {
      color: #fff;
      background: $green-color;
    }
  }
}
.submit {
  height: 54px;
  max-width: 345px;
  font-weight: 500;
  font-size: 17px;
  line-height: 22px;
}
.type-user {
  width: 100%;
  max-width: 345px;
  height: 35px;
  background: #ffffff;
  border: 1px solid #efefef;
  box-sizing: border-box;
  border-radius: 5px;

  .mortal {
    width: 100%;
    font-size: 13px;
    line-height: 16px;
    display: flex;
    align-items: center;
    justify-content: center;
    color: #252626;
    background: #ffffff;
    transition: 0.22s;

    &-active {
      background: #ff7a29;
      color: #fff;
      &:first-child {
        border-right: 1px solid $orange-color;
        border-top-right-radius: 5px;
        border-bottom-right-radius: 5px;
      }
      &:last-child {
        border-left: 1px solid $orange-color;
        border-top-left-radius: 5px;
        border-bottom-left-radius: 5px;
      }
    }
  }
}
.forgot-pass {
  margin-left: auto;
  font-size: 13px;
  line-height: 16px;
  color: #ff7a29;
  cursor: pointer;
  text-align: right;
}
.masks {
  width: 70px;
}
.mob {
  .logo {
    font-size: 15px;
    line-height: 18px;
  }
  .cart {
    .count {
      position: static;
    }
  }
  .mob_search {
    margin-top: 15px;
    max-width: unset;
    position: relative;
    .search-bar {
      width: 100%;
      height: 36px;
      background: #f2f3f2;
      border-radius: 10px;
      border-color: #f2f3f2;
    }
    button {
      height: 36px;
      border-radius: 0 10px 10px 0;
    }
  }
}
@media screen and (max-width: 600px) {
  .cart .count {
    font-size: 10px;
    line-height: 13px;
    white-space: nowrap;
  }
  .city {
    white-space: nowrap;
  }
}
</style>
